---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarDimensionalConstraintLost
source: html/9fad5f7c-cd3c-d5ee-1ef7-2da44fb84d2f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarDimensionalConstraintLost Property

Dimensional constraint on Rebar element was lost on upgrade.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarDimensionalConstraintLost { get; }
```